{
  "cryptocompare_cache": {
    "cryptocompare_all": {
      "data": [
        {
          "id": "53572570",
          "title": "From Bitcoin to XRP: Institutional Demand Skyrockets as Exchange Holdings Plunge 3%",
          "body": "Institutional Interest Expands Beyond Bitcoin as XRP Gains Recognition for Real-World Utility Institutional interest in digital assets is rapidly evolving, and it’s no longer centred solely around Bitcoin. As highlighted by renowned crypto researcher SMQKE, the latest episode of NASDAQ’s Trades show revealed a significant shift in market sentiment. The host emphasized that institutions are increasingly exploring the broader fundamentals and utility-driven cryptocurrencies shaping the future of g",
          "published_at": 1761296297,
          "source": "CryptoCompare",
          "url": "https://coinpaper.com/11866/from-bitcoin-to-xrp-institutional-demand-skyrockets-as-exchange-holdings-plunge-3",
          "categories": [
            "BTC",
            "EXCHANGE",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Ripple"
          ]
        },
        {
          "id": "53572449",
          "title": "US European Markets Edge Higher as Gold Slumps and Tech Stocks Rebound",
          "body": "US markets opened higher on Friday morning in 2025, with Dow futures down just 0.04%, S&P 500 futures up 0.06%, and Nasdaq 100 futures gaining 0.2%, signaling a stable close",
          "published_at": 1761296110,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/us-european-markets-edge-higher-as-gold-slumps-and-tech-stocks-rebound/",
          "categories": [
            "FIAT",
            "MARKET"
          ],
          "tags": [
            "News"
          ]
        },
        {
          "id": "53572405",
          "title": "Market Analysis Report (24 Oct 2025)",
          "body": "Trump Pardons Binance Founder CZ After Bank Secrecy Act Conviction | Revolut Gets Green Light to Offer Crypto Across EU Under New MiCA Rules | Aave Labs Acquires Stable Finance to Broaden Retail Access to Onchain Savings",
          "published_at": 1761295965,
          "source": "CryptoCompare",
          "url": "https://www.cryptocompare.com/email-updates/daily/2025/oct/24/",
          "categories": [
            "BTC",
            "ETH",
            "MARKET",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin",
            "Ethereum",
            "Daily Crypto News",
            "Cryptocurrency"
          ]
        },
        {
          "id": "53572128",
          "title": "8 Best Cryptos to Buy Under $1 – Before Whales Drive Prices Up (23 Oct, 2025)",
          "body": "The best crypto to buy under $1 is gaining traction among investors looking for scalable projects before they hit the mainstream spotlight. As the crypto market enters a new cycle of innovation and speculation, tokens like MoonBull ($MOBU), Cardano (ADA), BullZilla (BZIL), La Culex (CULEX), Hedera (HBAR), Stellar (XLM), Aster (ASTER), and Cronos (CRO) are standing out for their affordability, technology, and high potential returns. Each offers unique advantages that align with emerging trends ac",
          "published_at": 1761295545,
          "source": "CryptoCompare",
          "url": "https://timestabloid.com/8-best-cryptos-to-buy-under-1-before-whales-drive-prices-up/",
          "categories": [
            "ADA",
            "BUSINESS",
            "MARKET",
            "CRO",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Finance",
            "News"
          ]
        },
        {
          "id": "53572582",
          "title": "Stocks rise as global markets open higher, set to end a choppy week in the green",
          "body": "Markets opened higher Friday morning across the U.S. and Europe, aiming to close out a rocky week on a more stable note, according to data from CNBC. Traders returned with steady hands after inflation jitters, gold’s worst slump in nearly a year, oil shocks from new Russian sanctions, and brutal corporate layoffs all hammered sentiment earlier in the week. Dow futures slipped by just 18 points overnight. That’s a 0.04% dip, barely a wobble. S&P 500 futures rose 0.06%, and Nasdaq 100 futures edge",
          "published_at": 1761295530,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/global-markets-open-high-on-friday/",
          "categories": [
            "COMMODITY",
            "FIAT",
            "MARKET",
            "TRADING",
            "MACROECONOMICS"
          ],
          "tags": [
            "Economy",
            "EUR",
            "GBP",
            "Gold",
            "Intel",
            "Nvidia",
            "Target",
            "USD"
          ]
        },
        {
          "id": "53572118",
          "title": "Delisting News Starts Coming for the Altcoin That Announced Its Closure Three Days Ago! The Price Continues to Fall!",
          "body": "As is known, the altcoin named Kadena (KDA), which was once considered one of the most promising projects in the cryptocurrency world, announced that it has terminated all its business activities. Following the official announcement by the Kadena team, the KDA price lost nearly 40% of its value in a short time. Kadena said in a statement: “It is no longer possible for us to continue our business operations. The Kadena organization will immediately cease all commercial activities and active maint",
          "published_at": 1761295508,
          "source": "CryptoCompare",
          "url": "https://en.bitcoinsistemi.com/delisting-news-starts-coming-for-the-altcoin-that-announced-its-closure-three-days-ago-the-price-continues-to-fall/",
          "categories": [
            "ALTCOIN",
            "BUSINESS",
            "EXCHANGE",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Altcoin",
            "Analysis",
            "News"
          ]
        },
        {
          "id": "53572068",
          "title": "Fetch.ai Offers to Drop Claims for FET Token Return in Ocean Protocol Dispute",
          "body": "The FET token experienced a 93% price drop since the Artificial Superintelligence Alliance merger, attributed to broader market volatility rather than Ocean Protocol’s actions, as stated by its founder. Fetch.ai",
          "published_at": 1761295408,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/fetch-ai-offers-to-drop-claims-for-fet-token-return-in-ocean-protocol-dispute/",
          "categories": [
            "BLOCKCHAIN",
            "MARKET",
            "TRADING",
            "FET"
          ],
          "tags": [
            "News",
            "Core",
            "FET"
          ]
        },
        {
          "id": "53572579",
          "title": "A single whale bankrolls Stable’s pre-deposit phase with $500M",
          "body": "Stable, a new chain dedicated to USDT transfers, recently announced its first liquidity event. The funds were raised within a day, where one single whale contributed $500M. Stable, a chain built for USDT transfers and backed by Bitfinex, recently announced its pre-deposit campaign. The goal was to raise $825M, which was achieved within a few hours. Stable aims to draw in more USDT, offering lower costs and a chain optimized for the stablecoin. Currently, USDT is still mostly transferred on Ether",
          "published_at": 1761295217,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/stable-deposit-campaign-whale-500m/",
          "categories": [
            "ETH",
            "EXCHANGE",
            "USDT",
            "USDC",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Bitfinex",
            "Plasma",
            "Stable",
            "stbl",
            "Tether",
            "USDC",
            "USDT",
            "XPL"
          ]
        },
        {
          "id": "53571961",
          "title": "US-Australia Rare Earths Deal Could Boost Miners Like Graphinex",
          "body": "The US-Australia rare earths deal, signed by President Donald Trump and Prime Minister Anthony Albanese, injects $2 billion into critical minerals projects to counter China’s dominance. Australian miners like Graphinex",
          "published_at": 1761295211,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/us-australia-rare-earths-deal-could-boost-miners-like-graphinex/",
          "categories": [
            "ASIA",
            "MINING",
            "REGULATION"
          ],
          "tags": [
            "Mining",
            "News"
          ]
        },
        {
          "id": "53571960",
          "title": "Market Surges As Blockchain Futures Shatter $1 Trillion Barrier",
          "body": "Blockchain on-chain futures platforms surpassed $1 trillion in October. The market crash on October 10-11 triggered a significant surge in trading volume. Continue Reading: Market Surges As Blockchain Futures Shatter $1 Trillion Barrier The post Market Surges As Blockchain Futures Shatter $1 Trillion Barrier appeared first on COINTURK NEWS .",
          "published_at": 1761295162,
          "source": "CryptoCompare",
          "url": "https://en.coin-turk.com/market-surges-as-blockchain-futures-shatter-1-trillion-barrier/",
          "categories": [
            "BLOCKCHAIN",
            "MARKET",
            "TRADING"
          ],
          "tags": [
            "Cryptocurrency News"
          ]
        },
        {
          "id": "53571846",
          "title": "Bitcoin STH-SOPR at 0.992 May Signal Potential Market Bottom Formation",
          "body": "Bitcoin’s STH-SOPR has dropped to 0.992, signaling short-term holders are selling at a loss amid heightened market fear. This metric, tracking profits or losses for holders under 155 days, often",
          "published_at": 1761294940,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/bitcoin-sth-sopr-at-0-992-may-signal-potential-market-bottom-formation/",
          "categories": [
            "BTC",
            "MARKET",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Analysis",
            "News",
            "BTC"
          ]
        },
        {
          "id": "53571737",
          "title": "Nevada Regulators Halt Fortress Trust Amid Liquidity Risks, Sparking Concerns for Ripple-Linked Crypto Custody",
          "body": "Nevada regulators shut down Fortress Trust due to severe insolvency risks and liquidity shortfalls, protecting over 250,000 users from potential asset losses. The cease-and-desist order highlights unsafe practices, including failure",
          "published_at": 1761294750,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/nevada-regulators-halt-fortress-trust-amid-liquidity-risks-sparking-concerns-for-ripple-linked-crypto-custody/",
          "categories": [
            "MARKET"
          ],
          "tags": [
            "Analysis",
            "News"
          ]
        },
        {
          "id": "53571652",
          "title": "US Debt Surpasses $38T: Analyst Claims America Is ‘Going Broke’",
          "body": "The U.S. national debt has reached yet another milestone, surpassing the $38 trillion mark as the country fails to curb its spending and politicians across the aisle signal the dangers of this trend. The debt rose from $37 to $38 trillion in just months. U.S. Debt Surpasses $38T, Spending Expected To Rise The Facts: The",
          "published_at": 1761294602,
          "source": "CryptoCompare",
          "url": "https://news.bitcoin.com/us-debt-surpasses-38t-analyst-claims-america-is-going-broke/",
          "categories": [
            "OTHER"
          ],
          "tags": [
            "Economics",
            "economics",
            "United States US"
          ]
        },
        {
          "id": "53571699",
          "title": "Fetch.ai, Ocean Protocol agree on return of $120M in FET tokens to avoid legal battle",
          "body": "The FET token’s price fell by over 93% since the merger of the Artificial Superintelligence Alliance, a drop that is unrelated to Ocean Protocol’s actions, according to its founder.",
          "published_at": 1761294549,
          "source": "CryptoCompare",
          "url": "https://cointelegraph.com/news/fet-ocean-protocol-return-120m-legal-battle?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "categories": [
            "BLOCKCHAIN",
            "REGULATION",
            "TRADING",
            "FET"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "53571571",
          "title": "Dogecoin on the Edge: After a 36% Crash, Is the Worst Still to Come?",
          "body": "Dogecoin has experienced a significant decline over the past few weeks, with a 36% drop since its September high. At the time of writing, the popular meme coin is currently priced at $0.1981, compared to $0.3066, which is a concern for investors who may incur a loss. Source: CoinMarketCap Technical Indicators Signal Further Weakness The daily chart tells concerning news to the DOGE holders. The cryptocurrency has fallen below a consolidating upward wedge formation, a development typically follow",
          "published_at": 1761294501,
          "source": "CryptoCompare",
          "url": "https://coinpaper.com/11864/doge-price-plunges-while-new-etf-struggles-to-attract-investors",
          "categories": [
            "BUSINESS",
            "DOGE",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Reports"
          ]
        },
        {
          "id": "53571628",
          "title": "AI Investments Ignite Rally in High-Performance Computing Stocks",
          "body": "Oracle’s AI investments trigger positive momentum in AI and HPC stocks. Companies are aligning strategies to capitalize on AI developments. Continue Reading: AI Investments Ignite Rally in High-Performance Computing Stocks The post AI Investments Ignite Rally in High-Performance Computing Stocks appeared first on COINTURK NEWS .",
          "published_at": 1761294499,
          "source": "CryptoCompare",
          "url": "https://en.coin-turk.com/ai-investments-ignite-rally-in-high-performance-computing-stocks/",
          "categories": [
            "TRADING"
          ],
          "tags": [
            "Bitcoin (BTC)"
          ]
        },
        {
          "id": "53571648",
          "title": "US CPI Data Finally Drops Today: Will Bitcoin Relive Its Painful Past?",
          "body": "The United States government shutdown continues in full force, now in its 24th day. It became the second-longest in US history and is closing down the record of 35 days set during Trump’s first term in office in 2019. According to current data, about two million workers’ payments have been suspended, while 900,000 have been furloughed. In addition, numerous government-related sectors have fallen behind on certain deadlines, such as the release of the Consumer Price Index data for the previous mo",
          "published_at": 1761294477,
          "source": "CryptoCompare",
          "url": "https://cryptopotato.com/us-cpi-data-finally-drops-today-will-bitcoin-relive-its-painful-past/",
          "categories": [
            "BTC",
            "MARKET",
            "TRADING",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "AA News",
            "Crypto News",
            "Bitcoin (BTC) Price",
            "United States"
          ]
        },
        {
          "id": "53571529",
          "title": "AI Miners Surge Pre-Market on Record $38B Oracle Data Center Deal Boosts Sector",
          "body": "A massive Oracle-led AI infrastructure financing ignites a sharp rally in AI and HPC mining stocks.",
          "published_at": 1761294333,
          "source": "CryptoCompare",
          "url": "https://www.coindesk.com/markets/2025/10/24/ai-miners-surge-pre-market-on-record-usd38b-oracle-data-center-deal-boosts-sector",
          "categories": [
            "BTC",
            "MARKET",
            "MINING",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Markets",
            "AI",
            "Bitcoin",
            "Miners",
            "News"
          ]
        },
        {
          "id": "53571914",
          "title": "Australian rare-earth miners profit as US moves away from China",
          "body": "Australian rare earth companies just secured a windfall after Donald Trump’s administration and Prime Minister Anthony Albanese signed a rare earths and critical minerals deal this week in Washington, according to the Financial Times. The agreement sends $2 billion from both countries straight into projects meant to compete directly with China’s supply chain stronghold, and miners like Art Malone are cashing in. At 3am, Malone got a call that his company, Graphinex, was landing an A$1.3 billion ",
          "published_at": 1761294313,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/australian-rare-earth-miners-are-making-bank/",
          "categories": [
            "ASIA",
            "BUSINESS",
            "MARKET",
            "MINING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Economy",
            "Arafura",
            "AUD",
            "CNY",
            "Graphinex",
            "Northern Minerals",
            "RZ Resources",
            "USD"
          ]
        },
        {
          "id": "53571508",
          "title": "Animoca Brands Gains In-Principle VARA Approval for Crypto Brokerage in Dubai",
          "body": "Animoca Brands has received in-principle approval from Dubai’s Virtual Assets Regulatory Authority (VARA) for a crypto broker-dealer license, marking its expansion into regulated crypto brokerage services in the UAE. This",
          "published_at": 1761294301,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/animoca-brands-gains-in-principle-vara-approval-for-crypto-brokerage-in-dubai/",
          "categories": [
            "AXS",
            "BLOCKCHAIN",
            "MARKET",
            "SAND",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Analysis",
            "Blockchain",
            "News",
            "ATH",
            "AXS",
            "SAND"
          ]
        },
        {
          "id": "53571187",
          "title": "Nasdaq, S&P futures rise on Intel boost; focus on key retail inflation report",
          "body": "More on markets The Coming 2026 Housing Bust's Impact On The U.S. Economy A 5% Correction Is More Likely Than A Year-End Rally Falling Mortgage Rates Further Reduce Demand In The Housing Market (Not So Paradoxically) S&P 500 clocks strongest Q3 performance since 2020",
          "published_at": 1761293716,
          "source": "CryptoCompare",
          "url": "https://seekingalpha.com/news/4508077-sp500-nasdaq-dow-jones-outlook-stock-market-cpi?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=news",
          "categories": [
            "MARKET",
            "TRADING",
            "MACROECONOMICS"
          ],
          "tags": [
            "SPX",
            "INDU",
            "US100:IND",
            "INTC",
            "TSLA",
            "BTC-USD",
            "XAGUSD:CUR",
            "XAUUSD:CUR",
            "CL1:COM",
            "US10Y",
            "US2Y",
            "US30Y",
            "US5Y"
          ]
        },
        {
          "id": "53571182",
          "title": "XRP Could Rally on Buy Signal and Potential ETF Inflows",
          "body": "XRP’s price outlook remains bullish as analysts spot a key buy signal via the TD Sequential indicator, signaling a potential rally amid ETF approval anticipation. Trading at $2.39, XRP could",
          "published_at": 1761293713,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/xrp-could-rally-on-buy-signal-and-potential-etf-inflows/",
          "categories": [
            "BTC",
            "ETH",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Ripple",
            "BTC",
            "ETH",
            "XRP"
          ]
        },
        {
          "id": "53571135",
          "title": "Maxine Waters Questions Trump’s Binance Founder Pardon Amid Family Crypto Ties",
          "body": "US Representative Maxine Waters criticized President Donald Trump’s pardon of Binance co-founder Changpeng Zhao as a corrupt favor tied to crypto lobbying and family business interests, highlighting pay-to-play dynamics in",
          "published_at": 1761293600,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/maxine-waters-questions-trumps-binance-founder-pardon-amid-family-crypto-ties/",
          "categories": [
            "BUSINESS",
            "EXCHANGE",
            "REGULATION",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Core"
          ]
        },
        {
          "id": "53571590",
          "title": "Animoca Brands expands into crypto brokerage after Dubai VARA approval",
          "body": "Founded in 2014 by Yat Siu and David Kim, Animoca Brands has been a key Web3 player in gamification, metaverses, and NFTs, investing in over 540 companies, but it is now taking a leap into the crypto brokerage scene after receiving an in-principle license approval from Dubai’s Virtual Assets Regulatory Authority (VARA). On VARA’s website , Animoca Brands, under the name Animoca Brands Middle East Advisory FZCO, has received an in-principle approval for a crypto broker-dealer VASP service license",
          "published_at": 1761293563,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/animoca-brands-crypto-dubai-vara/",
          "categories": [
            "AXS",
            "BLOCKCHAIN",
            "BUSINESS",
            "EXCHANGE",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "AED",
            "Animoca Brands",
            "VARA"
          ]
        },
        {
          "id": "53571178",
          "title": "Worst Uptober ever? Bitcoin price risks first 'red' October in 8 years",
          "body": "Bitcoin remained red despite returning to the top of its local trading range, leading to warnings of the “worst Uptober ever” from disappointed bulls.",
          "published_at": 1761293546,
          "source": "CryptoCompare",
          "url": "https://cointelegraph.com/news/worst-uptober-ever-bitcoin-price-risks-first-red-october-in-8-years?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "categories": [
            "BTC",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "53571474",
          "title": "Worst Uptober ever? Bitcoin price risks first ‘red’ October in 8 years",
          "body": "Bitcoin remained red despite returning to the top of its local trading range, leading to warnings of the “worst Uptober ever” from disappointed bulls.",
          "published_at": 1761293546,
          "source": "CryptoCompare",
          "url": "https://cointelegraph.com/news/worst-uptober-ever-bitcoin-price-risks-first-red-october-in-8-years?utm_source=rss_feed&utm_medium=rss%3F_ts%3D1761294217598%26_dc%3D1761294217598%26rand%3Dxv4qq_1761294217598%26__%3D1761294217598&utm_campaign=rss_partner_inbound",
          "categories": [
            "BTC",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "53572251",
          "title": "Worst Uptober ever? Bitcoin price risks first ‘red’ October in years",
          "body": "Bitcoin remained red despite returning to the top of its local trading range, leading to warnings of the “worst Uptober ever” from disappointed bulls.",
          "published_at": 1761293546,
          "source": "CryptoCompare",
          "url": "https://cointelegraph.com/news/worst-uptober-ever-bitcoin-price-risks-first-red-october-in-8-years?utm_source=rss_feed&utm_medium=rss%3Ftimestamp%3D1761295706086%26_nocache%3D1761295706086%26ttl%3D0&utm_campaign=rss_partner_inbound",
          "categories": [
            "BTC",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "53571075",
          "title": "Bitcoin’s Negative STH-NUPL May Signal Short-Term Distress and Long-Term Bullish Potential",
          "body": "Bitcoin’s Short-Term Holder Net Unrealized Profit/Loss (STH-NUPL) has turned negative, indicating increasing stress among recent buyers as speculative leverage unwinds. This metric, which measures the profit or loss of coins",
          "published_at": 1761293517,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/bitcoins-negative-sth-nupl-may-signal-short-term-distress-and-long-term-bullish-potential/",
          "categories": [
            "BTC",
            "BUSINESS",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin",
            "Guides",
            "News",
            "BTC"
          ]
        },
        {
          "id": "53571031",
          "title": "Ford Shifts Workers from F-150 Lightning to Boost Gas and Hybrid Production Amid Supply Issues",
          "body": "Ford is pausing F-150 Lightning electric vehicle production and reassigning workers to boost gas and hybrid F-150 output by 50,000 units in 2026, addressing supply chain disruptions from a fire",
          "published_at": 1761293406,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/ford-shifts-workers-from-f-150-lightning-to-boost-gas-and-hybrid-production-amid-supply-issues/",
          "categories": [
            "OTHER"
          ],
          "tags": [
            "News",
            "Core"
          ]
        },
        {
          "id": "53570970",
          "title": "Bitcoin Exchange Upbit Announces Listing of This Altcoin on Its Spot Trading Platform! Here Are the Details",
          "body": "Upbit, one of South Korea's largest digital asset exchanges, announced that it will list the digital asset Orderly (ORDER) on the KRW (Korean won) market on October 24, 2025. Upbit Announces Listing of Orderly (ORDER) Token on KRW Market According to the exchange's official announcement, transaction support for the ORDER token running on the Ethereum network will be launched on October 24 at 16:00. Upbit emphasized that users must deposit and withdraw funds through the correct network before tra",
          "published_at": 1761293228,
          "source": "CryptoCompare",
          "url": "https://en.bitcoinsistemi.com/bitcoin-exchange-upbit-announces-listing-of-this-altcoin-on-its-spot-trading-platform-here-are-the-details-17/",
          "categories": [
            "ALTCOIN",
            "BTC",
            "EXCHANGE",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Altcoin",
            "Exchange",
            "News"
          ]
        },
        {
          "id": "1683360",
          "title": "Litecoin price prediction 2025-2031: Will LTC recover to $200 soon?",
          "body": "Key Takeaways: Litecoin’s price faces a surge toward $96 Our Litecoin price prediction for 2025 expects the maximum price of LTC to be $201. In 2030, we expect Litecoin to attain a maximum of $1,228. Following Bitcoin’s move toward $100K, Litecoin faced increasing buying activity. This surge in activity raises several questions for investors: Is it a good time to invest in Litecoin? Or Will Litecoin (LTC) hold above $200 in 2025? These are common questions that make predicting Litecoin’s price a",
          "published_at": 1761293088,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
          "categories": [
            "ALTCOIN",
            "BTC",
            "BUSINESS",
            "LTC",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto Price Predictions"
          ]
        },
        {
          "id": "53570864",
          "title": "Custodia and Vantage Banks Launch Platform for Tokenized Deposits and Stablecoins",
          "body": "Custodia Bank and Vantage Bank have launched a blockchain platform enabling traditional banks to issue tokenized deposits, backed by real U.S. dollars for faster transactions and enhanced security without disintermediation",
          "published_at": 1761292993,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/custodia-and-vantage-banks-launch-platform-for-tokenized-deposits-and-stablecoins/",
          "categories": [
            "BLOCKCHAIN",
            "FIAT"
          ],
          "tags": [
            "News",
            "Core"
          ]
        },
        {
          "id": "53570817",
          "title": "Financial Strategist: XRP Majorly Exists to Absorb and Settle Global Liquidity",
          "body": "Versan Aljarrah, co-founder of Black Swan Capitalist and a well-known advocate for XRP, has presented a view that positions the token not merely as a cryptocurrency but as a potential foundation for a rebalanced financial system. In a time of growing uncertainty about the structure of global finance, more experts are looking to digital assets like XRP as a solution. Aljarrah suggests that XRP’s function may extend far beyond payments or retail speculation, highlighting its role in managing liqui",
          "published_at": 1761292931,
          "source": "CryptoCompare",
          "url": "https://timestabloid.com/financial-strategist-xrp-majorly-exists-to-absorb-and-settle-global-liquidity/",
          "categories": [
            "EXCHANGE",
            "FIAT",
            "XRP",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Cryptocurrency",
            "News",
            "XRP"
          ]
        },
        {
          "id": "53570851",
          "title": "Trump’s CZ pardon draws fury from Maxine Waters over ‘pay-to-play’ crypto ties",
          "body": "Representative Maxine Waters slammed US President Donald Trump’s pardon of Binance co-founder Changpeng Zhao, calling it a corrupt favor.",
          "published_at": 1761292890,
          "source": "CryptoCompare",
          "url": "https://cointelegraph.com/news/trump-accused-of-rewarding-crypto-criminals-after-pardoning-binance-s-cz?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "categories": [
            "EXCHANGE",
            "REGULATION",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "53570756",
          "title": "US Crypto Bill Nears Bipartisan Agreement, Coinbase CEO Suggests",
          "body": "U.S. lawmakers are nearing agreement on a comprehensive crypto regulation bill, according to Coinbase CEO Brian Armstrong. Bipartisan talks on Capitol Hill have advanced significantly, with only minor details left",
          "published_at": 1761292840,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/us-crypto-bill-nears-bipartisan-agreement-coinbase-ceo-suggests/",
          "categories": [
            "BTC",
            "EXCHANGE",
            "MARKET",
            "REGULATION",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Analysis",
            "News",
            "BTC",
            "Core"
          ]
        },
        {
          "id": "53570775",
          "title": "BNB Reclaims $1,100 As Binance Founder Receives Presidential Pardon – New Rally Coming?",
          "body": "BNB has seen a 5.5% price jump following the White House announcement that Binance co-founder has been pardoned by US President Donald Trump, leading some analysts to suggest that a new leg up might be around the corner. Related Reading: Crypto Market Records ‘Particularly Robust’ Q3 Performance With 16% Active Trader Growth – Report US President Grants Pardon To Binance Founder On Thursday, the White House revealed that US President Donald Trump had pardoned Binance co-founder and former CEO Ch",
          "published_at": 1761292838,
          "source": "CryptoCompare",
          "url": "https://www.newsbtc.com/news/bnb-reclaims-1100-binance-founder-presidential-pardon/",
          "categories": [
            "EXCHANGE",
            "REGULATION",
            "TRADING",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Cryptocurrency Market News",
            "Binance",
            "Binance co-founder",
            "BNB",
            "BNB rally",
            "bnbusdt",
            "Chanpeng Zhao",
            "crypto analyst",
            "crypto market correction",
            "crypto market rally",
            "Crypto trader",
            "CZ",
            "CZ pardon",
            "US President Trump"
          ]
        },
        {
          "id": "53570777",
          "title": "Canada’s AML Watchdog Slaps Cryptomus With $126 Million Fine Amid Major Compliance Lapses",
          "body": "Canada’s anti-money laundering (AML) watchdog, The Financial Transactions and Reports Analysis Centre of Canada (FINTRAC), recently announced that it had imposed a fine of $126 million on crypto trading platform Cryptomus for failure to report illicit transactions. FINTRAC Slaps $126 Million Fine On Crypto Exchange Cryptomus According to an official announcement on October 22, Canada’s FINTRAC has slapped a massive penalty of $126 million on Vancouver-based digital assets trading platform Crypto",
          "published_at": 1761292834,
          "source": "CryptoCompare",
          "url": "https://bitcoinist.com/canadas-aml-cryptomus-126-million-major-compliance/",
          "categories": [
            "BTC",
            "EXCHANGE",
            "SPONSORED",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "AML",
            "Anti-Money Laundering",
            "bitcoin",
            "btc",
            "BTCUSDT",
            "Canada",
            "crypto",
            "Cryptocurrency",
            "Cryptomus",
            "digital asset",
            "fintrac"
          ]
        },
        {
          "id": "53570757",
          "title": "Bitcoin: Why THIS signal echoes BTC’s pre-rally setup from last year",
          "body": "Bitcoin’s short-term holders face stress as on-chain data hints at a potential market reset.",
          "published_at": 1761292805,
          "source": "CryptoCompare",
          "url": "https://ambcrypto.com/bitcoin-why-this-signal-echoes-btcs-pre-rally-setup-from-last-year/",
          "categories": [
            "BTC",
            "MARKET",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin",
            "BTC Trading View",
            "News",
            "News 1",
            "Social",
            "Trading View"
          ]
        },
        {
          "id": "53570749",
          "title": "Cryptocurrency Markets Brace for Impact as Inflation Data Hits",
          "body": "The cryptocurrency market keenly awaits September CPI data revelations. High inflation figures might bolster the dollar, affecting crypto movements. Continue Reading: Cryptocurrency Markets Brace for Impact as Inflation Data Hits The post Cryptocurrency Markets Brace for Impact as Inflation Data Hits appeared first on COINTURK NEWS .",
          "published_at": 1761292763,
          "source": "CryptoCompare",
          "url": "https://en.coin-turk.com/cryptocurrency-markets-brace-for-impact-as-inflation-data-hits/",
          "categories": [
            "MARKET",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Cryptocurrency News"
          ]
        },
        {
          "id": "53570595",
          "title": "Canada Slashes Tariff Quotas for Stellantis and GM After Ontario Production Cuts",
          "body": "Canada has reduced tariff-free import quotas for Stellantis by 50% and General Motors by 24.2% due to their scaled-back production commitments in Ontario, breaching prior agreements with Canadian workers and",
          "published_at": 1761292526,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/canada-slashes-tariff-quotas-for-stellantis-and-gm-after-ontario-production-cuts/",
          "categories": [
            "MACROECONOMICS"
          ],
          "tags": [
            "News"
          ]
        },
        {
          "id": "53570936",
          "title": "Ford moves electric-vehicle staff to ramp up F-150 output in Dearborn",
          "body": "Ford is pulling workers off its stalled electric truck line and tossing them back into its bread-and-butter operation; gas and hybrid F‑150 production. On Thursday, the company announced it’s transferring all hourly staff from its Rouge Electric Vehicle Center in Dearborn, Michigan, to the nearby Dearborn Truck Plant to push out more units of the F-Series, especially the F-150. This comes as Ford sets a new goal: boost F-Series output by 50,000 trucks in 2026, all in efforts of making up for los",
          "published_at": 1761292525,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/ford-redeploys-staff-from-ev-plant/",
          "categories": [
            "BUSINESS",
            "EXCHANGE",
            "SPONSORED",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Tech",
            "ford",
            "USD"
          ]
        },
        {
          "id": "53570431",
          "title": "Surprise Altcoin Launches Major Buyback Program! Announces Radical Change!",
          "body": "While Ethereum (ETH) and many altcoins continue to be adopted by major corporations as part of their treasury strategy, the latest news came for a very surprising altcoin. At this point, the Covalent team announced the launch of the Covalent Strategic Reserve to power the Covalent X Token (CXT). Accordingly, Covalent announced the launch of the Covalent Strategic Reserve, a multi-year locked reserve funded by on-chain and off-chain revenues, including periodic CXT buybacks. The Reserve aims to a",
          "published_at": 1761292147,
          "source": "CryptoCompare",
          "url": "https://en.bitcoinsistemi.com/surprise-altcoin-launches-major-buyback-program-announces-radical-change/",
          "categories": [
            "ALTCOIN",
            "ETH",
            "FIAT",
            "MARKET",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Altcoin",
            "Analysis",
            "News"
          ]
        },
        {
          "id": "53570429",
          "title": "Coins, Gems & $SACHI: The 3-Tier Economy",
          "body": "SACHI brings fun to gaming with premium experiences and community-driven engagement rewards with a simple, three-layered economy ahead of the TGE. [Dubai, UAE] SACHI’s immersive Web3 competitive gaming universe aims to solve one of the most conspicuous issues that users face in Web3 gaming — understanding how tokens fit into the game’s ecosystem. SACHI is based on a three-tier economy built on models that help players clearly understand the roles of each layer: Users play games with coins Gems u",
          "published_at": 1761292141,
          "source": "CryptoCompare",
          "url": "https://timestabloid.com/coins-gems-sachi-the-3-tier-economy/",
          "categories": [
            "BUSINESS",
            "MARKET",
            "REGULATION",
            "SPONSORED",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Finance",
            "News"
          ]
        },
        {
          "id": "53570385",
          "title": "Trump Threatens Additional Tariffs on China as Trade Tensions Rise",
          "body": "Trade tensions rise as Trump threatens more tariffs on China. Upcoming meeting could significantly affect global markets. Continue Reading: Trump Threatens Additional Tariffs on China as Trade Tensions Rise The post Trump Threatens Additional Tariffs on China as Trade Tensions Rise appeared first on COINTURK NEWS .",
          "published_at": 1761292127,
          "source": "CryptoCompare",
          "url": "https://en.coin-turk.com/trump-threatens-additional-tariffs-on-china-as-trade-tensions-rise/",
          "categories": [
            "ASIA",
            "MARKET",
            "MACROECONOMICS"
          ],
          "tags": [
            "Bitcoin (BTC)"
          ]
        },
        {
          "id": "53570448",
          "title": "“Grateful and Motivated,” CZ Says After Trump’s Presidential Pardon",
          "body": "Changpeng “CZ” Zhao, the founder of Binance, the world’s largest cryptocurrency exchange, has received a full pardon from U.S. President Donald Trump. Visit Website",
          "published_at": 1761292122,
          "source": "CryptoCompare",
          "url": "https://thecryptobasic.com/2025/10/24/grateful-and-motivated-cz-says-after-trumps-presidential-pardon/?utm_source=rss&utm_medium=rss&utm_campaign=grateful-and-motivated-cz-says-after-trumps-presidential-pardon",
          "categories": [
            "EXCHANGE",
            "MARKET",
            "REGULATION",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Market",
            "Latest Changpeng Zhao (CZ) News Today"
          ]
        },
        {
          "id": "53570349",
          "title": "Pi Network Users Pay Attention: Key News on the Verification Front",
          "body": "Ever since its inception over half a decade ago, the Pi Network project has attracted millions of users, even before it officially launched, but also a fair share of controversy and criticism. One of those has been the verification process, with countless users complaining online about having to wait weeks or even months only to be denied at the end. Now, though, the team behind the project has issued a new update, providing more detailed information on the KYC procedures, the number of successf",
          "published_at": 1761292022,
          "source": "CryptoCompare",
          "url": "https://cryptopotato.com/pi-network-users-pay-attention-key-news-on-the-verification-front/",
          "categories": [
            "BLOCKCHAIN",
            "BUSINESS",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto Bits",
            "Crypto News",
            "Pi Network (PI)"
          ]
        },
        {
          "id": "53570617",
          "title": "Canada halves Stellantis’ tariff-free quota",
          "body": "Canada has decided to reduce trade benefits for Stellantis NV and General Motors Co. after both automakers scaled back their manufacturing commitments in Ontario. The Canadian Department of Finance announced on Thursday that Stellantis’ tariff-free import quota will be slashed by 50%, and GM’s will be cut by 24.2%. Ottawa’s auto remission framework allows U.S.-assembled vehicles to enter Canada tariff-free only if the automakers maintain local production. Finance Minister Philippe Champagne reve",
          "published_at": 1761291918,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/canada-slashes-50-on-stellantis-tariff/",
          "categories": [
            "BLOCKCHAIN",
            "EXCHANGE",
            "MARKET",
            "REGULATION",
            "TRADING",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Economy",
            "BYD",
            "CAD",
            "General Motors",
            "Jeep",
            "Stellantis",
            "USD",
            "USMCA"
          ]
        },
        {
          "id": "53570266",
          "title": "Hyperliquid Leads DEX Surge as Perp Trading Volume Tops $1 Trillion in Record-Breaking October",
          "body": "Decentralized perpetual trading has hit a new milestone, surpassing $1 trillion in monthly volume for the first time ever, with a week still left in October. Key Takeaways: Decentralized perpetual trading volume surpassed $1 trillion in October, setting a new monthly record. Hyperliquid led the surge with over $317 billion in trades, contributing to a $78 billion single-day volume peak. The gap between DEXs and CEXs is narrowing as decentralized platforms improve speed, liquidity, and accessibil",
          "published_at": 1761291854,
          "source": "CryptoCompare",
          "url": "https://cryptonews.com/news/hyperliquid-leads-dex-surge-as-perp-trading-volume-tops-1t/",
          "categories": [
            "EXCHANGE",
            "MARKET",
            "TRADING",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Altcoin News",
            "DeFi",
            "hyperliquid",
            "Perpetual Futures"
          ]
        },
        {
          "id": "53570134",
          "title": "Bitcoin, European Stocks Buoyant as Trump-Xi Meeting Confirmed",
          "body": "The impending meeting comes amid escalating trade tensions, with President Trump threatening to impose additional tariffs on China",
          "published_at": 1761291600,
          "source": "CryptoCompare",
          "url": "https://www.coindesk.com/markets/2025/10/24/bitcoin-buoyant-as-trump-xi-meeting-confirmed",
          "categories": [
            "ASIA",
            "BTC",
            "MARKET",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Markets",
            "Bitcoin",
            "News"
          ]
        },
        {
          "id": "8276",
          "title": "SushiSwap price prediction 2025-2031: Is SUSHI a good investment?",
          "body": "Key takeaway: Our Sushiswap price prediction anticipates a high of $0.97 by the end of 2025. In 2028, the coin is expected to range between $1.96 and $2.79, with an average price of $2.43. In 2031, SUSHI is expected to range between $3.48 and $4.61, with an average price of $4.04. SushiSwap is a decentralized exchange fork of Uniswap, a popular exchange. It offers several additional features not present in Uniswap, making it popular in the DeFi space. It is the largest DEX on the Binance Smart C",
          "published_at": 1761291316,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/sushiswap-price-prediction/",
          "categories": [
            "EXCHANGE",
            "MARKET",
            "SUSHI",
            "TRADING",
            "UNI",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto Price Predictions"
          ]
        }
      ],
      "timestamp": 1761296525608,
      "ttl": 900
    }
  },
  "saved_at": 1761296525608
}